app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (rating IN ('G','NC-17','PG','PG-13','R')) ORDER BY release_date
SELECT "movies".* FROM "movies"
---
  def index
    @all_ratings = ['G', 'PG', 'PG-13','NC-17', 'R']

    session[:ratings] = params[:ratings] if params[:ratings]
    session[:sort]    = params[:sort]    if params[:sort]

    if session[:ratings] || session[:sort]
      case session[:sort]
      when 'title'
        @title_hilite = 'hilite'
      when 'release_date'
        @release_hilite = 'hilite'
      end

      session[:ratings] ||= @all_ratings
      @ratings = session[:ratings]
      @ratings = @ratings.keys if @ratings.respond_to?(:keys)
      @movies = Movie.find(:all,
                           order: session[:sort],
                           conditions: ["rating IN (?)", @ratings])
    else
      @movies = Movie.all